---
kind: property
id: P:Autodesk.Revit.DB.GroupLoadOptions.IncludeAttachedDetails
source: html/11e6ebc0-bf3b-83ac-a2bf-5d203b22167e.htm
---
# Autodesk.Revit.DB.GroupLoadOptions.IncludeAttachedDetails Property

True if attached detail groups should be included, false otherwise.
 The default value is True true true ( True in Visual Basic) .

## Syntax (C#)
```csharp
public bool IncludeAttachedDetails { get; set; }
```